"%1$@ •••• %2$@" = "%1$@ •••• %2$@";

"+ Add" = "+Magdagdag";

"Add US bank account" = "Magdagdag ng account sa bangko ng US";

"Add a card" = "Magdagdag ng isang kard";

"Add a payment method" = "Magdagdag ng paraan ng pagbabayad";

"Add card" = "Magdagdag ng kard";

"Add new card" = "Magdagdag ng bagong kard";

"Add new payment method" = "Magdagadag ng bagong pamamaraan ng pagbabayad";

"Add your payment information" = "Magdagdag ng iyong impormasyon sa pagbabayad";

"Approve payment" = "Aprubahan ang pagbabayad";

"Back" = "Bumalik";

"Bank" = "Bangko";

"Bank account" = "Account sa bangko";

"Buy now or pay later with <img/>" = "Bumili ngayon o magbayad sa ibang pagkakataon gamit ang <img/>";

"Buy now or pay later with Afterpay" = "Bumili ngayon o magbayad sa ibang pagkakataon gamit ang Afterpay";

"Buy now or pay later with Clearpay" = "Bumili ngayon o magbayad sa ibang pagkakataon gamit ang Clearpay";

"Buy now or pay later with Klarna" = "Bumili ngayon o magbayad sa ibang pagkakataon gamit ang Klarna";

"Buy using a UPI ID" = "Bumili gamit ang isang UPI ID";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Sa pagkumpirma sa iyong pagbabayad sa PayPal, pinapayagan mo ang %@ na singilin ang iyong PayPal account para sa mga pagbabayad sa hinaharap alinsunod sa kanilang mga tuntunin.";

"By continuing to Amazon Pay, you allow %@ to charge your Amazon Pay account for future payments in accordance with their terms." = "Sa pagpapatuloy sa Amazon Pay, pinahihintulutan mo ang %@ na singilin ang iyong Amazon Pay account para sa mga pagbabayad sa hinaharap alinsunod sa kanilang mga tuntunin.";

"By continuing to Klarna, you allow %@ to charge your Klarna account for future payments in accordance with their terms and Klarna's terms. You can change this at any time in your Klarna app or by reaching out to %@." = "Sa pagpapatuloy sa Klarna, pinahihintulutan mo ang %1$@ na singilin ang iyong Klarna account para sa mga pagbabayad sa hinaharap alinsunod sa kanilang mga tuntunin. Maaari mong palitan ito anumang oras sa iyong Klarna app o sa pakikipag-ugnayan sa %2$@.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Sa pagpapatuloy sa PayPal, pinapayagan mo ang %@ na singilin ang iyong PayPal account para sa mga pagbabayad sa hinaharap alinsunod sa kanilang mga tuntunin.";

"By continuing to Revolut Pay, you allow %@ to charge your Revolut Pay account for future payments in accordance with their terms." = "Sa pagpapatuloy sa Revolut Pay, pinapayagan mo ang %@ na singilin ang iyong Revolut Pay account para sa mga pagbabayad sa hinaharap alinsunod sa kanilang mga tuntunin.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Sa pagpapatuloy, sumasang-ayon ka na pahintulutan ang mga pagbabayad alinsunod sa <terms>mga tuntuning ito</terms>.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Sa pagpapatuloy, binibigyan mo ng awtorisasyon ang %1$@ na i-debit ang iyong Cash App account para sa pagbabayad na ito at sa mga pagbabayad sa hinaharap alinsunod sa mga tuntunin ng  %2$@, hanggang bawiin mo ang awtorisasyong ito. Maaari mong palitan ito sa anumang oras sa iyong Cash App Settings.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Sa pagsali sa Link, sumasang-ayon ka sa <terms>Mga Tuntunin</terms> at <privacy>Patakaran sa Pagkapribado</privacy>.";

"By providing your bank account details and confirming this payment, you agree to this Direct Debit Request and the <terms>Direct Debit Request service agreement</terms>, and authorise Stripe Payments Australia Pty Ltd ACN 160 180 343 Direct Debit User ID number 507156 (“Stripe”) to debit your account through the Bulk Electronic Clearing System (BECS) on behalf of %@ (the \"Merchant\") for any amounts separately communicated to you by the Merchant. You certify that you are either an account holder or an authorised signatory on the account listed above." = "Sa pagbibigay ng mga detalye ng iyong account sa bangko at pagkumpirma sa pagbabayad na ito, sumasang-ayon ka sa Kahilingan sa Direktang Debit na ito at sa <terms>kasunduan sa serbisyo ng Kahilingan sa Direktang Debit</terms>, at pinahihintulutan ang Stripe Payments Australia Pty Ltd ACN 160 180 343 Direct Debit User ID number 507156 (ang “Stripe”) para i-debit ang iyong account gamit ang Bulk Electronic Clearing System (BECS) sa ngalan ng %@ (ang \"Mangangalakal\") para sa anumang halagang hiwalay na ipinaalam sa iyo ng Mangangalakal. Pinapatunayan mong isa kang may hawak ng account o isang awtorisadong tagalagda sa account na nakalista sa itaas.";

"By providing your card information, you allow %@ to charge your card for future payments in accordance with their terms." = "Sa pagbibigay ng impormasyon ng iyong kard, pinahihintulutan mo ang %@ na singilin ang iyong kard para sa mga pagbabayad sa hinaharap alinsunod sa kanilang mga tuntunin.";

"By providing your email, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Sa pagbibigay ng iyong email, sumasang-ayon ka na gumawa ng Link account at i-save ang impormasyon ng iyong pagbabayad sa Link, alinsunod sa <terms>Mga Tuntunin</terms> at <privacy>Patakaran sa Pagkapribado</privacy> ng Link.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Sa pagbibigay ng iyong impormasyon ng pagbabayad at pagkukupirma sa bayad na ito, pinapayagan mo ang (A) %@ at ang Stripe, ang ating payment service provider, na magpadala ng mga tagubilin sa iyong bangko para i-debit ang iyong account at (B) ang iyong bangko na i-debit ang iyong account ayon sa mga naturang tuntunin. Bilang bahagi ng iyong mga karapatan, maaari kang makakuha ng refund mula sa iyong bangko sa ilalim ng mga takda at kundisyon ng iyong kasunduan sa iyong bangko. Ang refund ay dapat hingin sa loob ng 8 linggo mula sa petsa na na-debit ang iyong account. Ang iyong mga karapatan ay naipaliwanag sa isang pahayag na maari mong makuha sa iyong bangko. Pumapayag ka na makatanggap ng mga abiso ukol sa mga debit sa hinaharap ng hanggang 2 na araw bago sila maganap.";

"By providing your phone number, you agree to create a Link account and save your payment info to Link, according to the Link <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Sa pagbibigay ng iyong numero ng telepono, sumasang-ayon ka na gumawa ng Link account at i-save ang impormasyon ng iyong pagbabayad sa Link, alinsunod sa <terms>Mga Tuntunin</terms> at <privacy>Patakaran sa Pagkapribado</privacy> ng Link.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Sa pag-save ng iyong account sa bangko para sa %@ sumasang-ayon ka na pahintulutan ang mga pagbabayad alinsunod sa <terms>mga tuntuning ito</terms>.";

"CPF/CPNJ" = "CPF/CPNJ";

"Cancel and pay another way" = "Kanselahin at magbayad sa ibang paraan";

"Choose a payment method" = "Pumili ng pamamaraan ng pagbabayad";

"Close card scanner" = "Isara ang scanner ng kard";

"Confirm" = "Kumpirmahin";

"Confirm the payment in your bank or payment app within %@ to complete the purchase." = "Kumpirmahin ang pagbabayad sa iyong bangko o app ng pagbabayad sa loob ng %@ para kumpletuhin ang pagbili.";

"Confirm the payment in your bank's app within %@ to complete the purchase." = "Kumpirmahin ang pagbabayad sa app ng iyong bangko sa loob ng %@ para kumpletuhin ang pagbili.";

"Confirm your CVC" = "Kumpirmahin ang iyong CVC";

"Contact information" = "Impormasyon sa pakikipag-ugnayan";

"EPS Bank" = "EPS Bank";

"Enter address manually" = "Manwal na ilagay ang address";

"FPX Bank" = "FPX Bank";

"I understand that Stripe will be collecting Direct Debits on behalf of %@ and confirm that I am the account holder and the only person required to authorise debits from this account." = "Nauunawaan ko na mangongolekta ang Stripe ng Direct Debits sa ngalan ng  %@ at kinukumpirma ko na ako ang may-ari ng account at tanging taong kinakailangan na magpahintulot sa mga debit mula sa account na ito..";

"IBAN" = "IBAN";

"Manage payment method" = "Pangasiwaan ang paraan ng pagbabayad";

"Manage payment methods" = "Pangasiwaan ang mga paraan ng pagbabayad";

"Manage your payment methods" = "Pangasiwaan ang iyong mga paraan ng pagbabayad";

"Name on card" = "Pangalan sa kard";

"New card" = "Bagong kard";

"New payment method" = "Bagong paraan ng pagbabayad";

"Open your UPI app to approve your payment within %@" = "Buksan ang iyong UPI app para aprubahan ang iyong pagbabayad sa loob ng  %@";

"Or" = "O";

"Or pay using" = "O magbayad gamit ang";

"Or pay with a card" = "O magbayad gamit ang kard";

"Or use" = "O gumamit ng";

"Or use a card" = "O gumamit ng kard";

"Pay %@" = "Magbayad ng %@";

"Pay another way" = "Magbayad sa ibang paraan";

"Pay faster at %@ and thousands of businesses." = "Magbayad nang mas mabilis sa %@ at sa libu-libong mga negosyo.";

"Pay over time with %@" = "Magbayad ng over time gamit ang %@";

"Pay over time with Affirm" = "Magbayad ng over time gamit ang Affirm";

"Pay with Link" = "Magbayad gamit ang Link";

"Pay with your bank account in just a few steps." = "Magbayad gamit ang iyong account sa bangko sa ilang hakbang lamang.";

"Payment failed" = "Nabigo ang pagbabayad";

"Please go back and select another payment method" = "Mangyaring bumalik at pumili ng ibang paraan ng pagbabayad.";

"Point the camera at your card." = "Itapat ang kamera sa iyong kard.";

"Processing..." = "Pinoproseso...";

"Przelewy24 Bank" = "Przelewy24 Bank";

"Remove card?" = "Alisin ang kard?";

"Remove payment method" = "Alisin ang paraan ng pagbabayad";

"Save" = "I-save";

"Save a new payment method" = "I-save ang bagong paraan ng pagbabayad";

"Save address" = "I-save ang address";

"Save for future payments" = "I-save para sa mga pagbabayad sa hinaharap";

"Save payment details to %@ for future purchases" = "I-save ang mga detalye ng pababayad sa %@ para sa mga pagbili sa hinaharap";

"Save this account for future %@ payments" = "I-save ang account na ito para sa mga pagbabayad sa hinaharap sa %@";

"Save your bank account in just a few steps." = "I-save ang iyong account sa bangko sa ilang hakbang lamang.";

"Save your info for secure 1-click checkout with Link" = "I-save ang iyong impormasyon para sa ligtas na 1-click na pag-checkout sa Link";

"Saved" = "Nai-save";

"Select card" = "Pumili ng kard";

"Select payment method" = "Pumili ng paraan ng pagbabayad";

"Select your payment method" = "Piliin ang iyong paraan ng pagbabayad";

"Set up" = "I-set up";

"Shipping to %@ is not supported." = "Hindi sinusuportahan ang pagpapadala sa %@.";

"Show menu" = "Ipakita ang menu";

"Simple, secure one-click payments" = "Simple, ligtas na isang-click na mga pagbabayad";

"Something went wrong when linking your account.\nPlease try again later." = "May nangyaring mali sa pag-link ng iyong account.\nMangyaring subukan muli mamaya.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you'll get an email with instructions to finish saving your bank account with %@." = "Idedeposito ng Stripe ang $0.01 sa iyong account sa loob ng 1-2 araw ng trabaho. Pagkatapos ay makakatanggap ka ng email na may mga tagubilin na tapusin ang pag-save sa iyong account sa bangko sa %@.";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Idedeposito ng Stripe ang $0.01 sa iyong account sa loob ng 1-2 araw ng trabaho. Pagkatapos ay makakatanggap ka ng email na may mga tagubilin para kumpletuhin ang pagbabayad sa %@.";

"The IBAN you entered is incomplete." = "Ang IBAN na iniligay mo ay di kumpleto.";

"The IBAN you entered is invalid, \"%@\" is not a supported country code." = "Ang IBAN na iniligay mo ay hindi valid. ang \"%@\" ay hindi suportadong code ng bansa.";

"Update" = "I-update";

"Update card brand" = "I-update ang brand ng kard";

"View more" = "Tingnan ang higit pa";

"Your IBAN should start with a two-letter country code." = "Ang iyong IBAN ay dapat magsimula sa dalawang letra na code ng bansa.";

"iDEAL Bank" = "iDEAL Bank";
